---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonPanel(Autodesk.Revit.UI.Tab,System.String)
source: html/d2bde88f-d642-83d1-371a-736d44e7809b.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonPanel Method

## Syntax (C#)
```csharp
public override RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
```

## Parameters
- **tab** (`Autodesk.Revit.UI.Tab`)
- **panelName** (`System.String`)